In [2]:
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import json

In [19]:
# Load the csv exported in Part I to a DataFrame
diversity_df = pd.read_csv("Data\Employee Diversity in Tech.csv",sep="\t")
tech_salaries = pd.read_csv("Data\Top tech companies comparison 2014_2015.csv")
salary_survey = pd.read_csv("Data\Data_Professional_Salary_Survey_Responses.csv",encoding='latin1')

# salary_survey
diversity_df

,Date,Type,Company,Female %,Male %,% White,% Asian,% Latino,% Black,% Multi,% Other,% Undeclared
0,2014,Country,U.S. Population,50.79,49.21,64.0,4.0,16.0,12.0,1.0,3.00,NaN
1,2014,Social Media,Facebook,31.00,69.00,57.0,34.0,4.0,2.0,3.0,-,NaN
2,2014,Social Media,Instagram,31.00,69.00,57.0,34.0,4.0,2.0,3.0,-,NaN
3,2014,Social Media,Google+,30.00,70.00,61.0,30.0,3.0,2.0,4.0,NaN,NaN
4,2014,Social Media,YouTube,30.00,70.00,61.0,30.0,3.0,2.0,4.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
157,May 2018,Tech,Netflix,43.00,57.00,49.0,24.0,6.0,4.0,NaN,4.00,13.0
158,May 2018,Tech,Yelp,54.00,46.00,62.0,15.0,10.0,6.0,5.0,2.00,NaN
159,May 2018,Entity,DiversityInc top 50,44.00,56.00,78.0,6.0,7.0,9.0,NaN,NaN,NaN
160,May 2018,Entity,Fortune 500 CEOs,6.00,94.00,73.0,21.0,3.0,2.0,0.5,0.50,NaN
161,May 2018,Government,US Congress,20.00,80.00,80.0,3.0,7.0,9.0,NaN,1.00,NaN

In [12]:
tech_diversity = diversity_df[diversity_df["Type"] == "Tech"]
tech_div_summary = tech_diversity.groupby("Company").mean()
tech_div_summary

,Female %,Male %,% White,% Asian,% Latino,% Black,% Multi,% Undeclared
Company,,,,,,,,
AirBnB,41.150000,59.000000,49.810,36.360000,7.440000,3.450000,2.520,NaN
Amazon,37.800000,62.200000,55.200,13.000000,10.600000,17.400000,NaN,NaN
Apple,31.400000,68.600000,54.600,18.800000,12.000000,8.400000,2.400,4.20
Cisco,23.400000,76.600000,53.600,37.000000,5.000000,4.000000,1.000,NaN
Dell,29.200000,71.070000,68.650,9.110000,11.140000,10.040000,NaN,NaN
Etsy,52.500000,47.500000,79.000,10.500000,4.000000,3.000000,3.500,NaN
Google,30.600000,69.400000,57.800,32.800000,3.400000,2.200000,3.600,NaN
Groupon,45.800000,54.200000,67.400,17.000000,6.200000,5.600000,NaN,NaN
HP,34.600000,65.400000,72.400,8.400000,11.600000,5.800000,1.400,NaN
Indiegogo,47.000000,53.000000,61.600,25.000000,7.600000,2.800000,NaN,NaN
Ingram Micro,37.600000,62.532000,58.618,11.912000,17.020000,11.678000,1.000,NaN
Intel,25.500000,74.744000,55.646,30.930000,8.738000,3.766000,0.600,NaN
Microsoft,27.400000,72.600000,58.120,29.740000,5.460000,3.700000,1.520,NaN
Netflix,43.000000,57.000000,49.000,24.000000,6.000000,4.000000,NaN,13.00
Nvidia,16.430000,83.570000,37.600,44.400000,3.000000,1.000000,14.000,NaN
Pandora,49.000000,51.000000,68.600,13.600000,7.400000,3.800000,5.600,NaN
Salesforce,29.780000,70.140000,66.138,22.774000,3.980000,2.306000,2.312,1.99
Slack,44.700000,55.300000,58.700,24.400000,6.900000,4.900000,4.400,NaN
Uber,36.733333,63.266667,49.400,31.366667,5.766667,8.566667,4.300,NaN
Yahoo!,37.000000,62.400000,47.400,41.800000,4.000000,2.000000,2.000,1.00
Yelp,54.000000,46.000000,62.000,15.000000,10.000000,6.000000,5.000,NaN
eBay,41.200000,58.800000,56.600,30.600000,5.000000,5.600000,1.000,NaN

In [15]:
tech_companies = list(tech_diversity["Company"].unique())
tech_companies

['Yahoo!',
 'Google',
 'Apple',
 'Cisco',
 'eBay',
 'HP',
 'Indiegogo',
 'Nvidia',
 'Dell',
 'Ingram Micro',
 'Intel',
 'Groupon',
 'Amazon',
 'Salesforce',
 'Pandora',
 'Microsoft',
 'Etsy',
 'Uber',
 'Slack',
 'AirBnB',
 'Netflix',
 'Yelp']

In [20]:
tech_salaries

,Employer Name,Early Career Median Pay,Mid-Career Median Pay,Median Age,Years of Experience,Years with Company,% Female,% High Job Satisfaction,% High Job Meaning,% High Job Stress
0,HP,"$65,400","$104,200",38,7.7,6.3,32%,64%,41%,56%
1,Oracle,"$71,400","$126,400",37,9.0,5.3,29%,64%,32%,56%
2,IBM,"$72,700","$112,700",36,7.4,7.1,25%,59%,40%,62%
3,Microsoft,"$102,500","$139,700",33,6.4,4.8,27%,72%,59%,58%
4,Qualcomm,"$94,400","$132,500",33,7.7,4.3,20%,69%,50%,62%
5,Cisco,"$83,800","$134,700",33,6.7,4.0,23%,76%,60%,52%
6,eBay,"$88,900","$136,000",33,6.9,2.7,43%,78%,55%,66%
7,Samsung,"$65,900","$143,000",33,6.0,2.3,37%,64%,36%,69%
8,Intel,"$85,800","$129,400",32,5.5,5.0,25%,72%,66%,61%
9,Adobe,"$91,900","$141,900",31,5.2,3.3,28%,84%,24%,47%
10,Apple,"$91,300","$145,400",31,6.0,2.7,31%,73%,74%,66%
11,Amazon,"$81,900","$130,400",30,5.2,2.0,26%,69%,42%,66%
12,Google,"$106,900","$151,600",30,5.2,2.0,30%,89%,72%,53%
13,Salesforce,"$84,800","$154,600",30,5.3,1.8,30%,89%,54%,55%
14,Tesla,"$81,400","$118,500",30,5.6,1.6,20%,70%,89%,70%
15,LinkedIn,"$110,800","$159,600",29,5.0,NaN,42%,NaN,NaN,NaN
16,SpaceX,"$78,500",NA,29,6.1,2.3,14%,73%,92%,88%
17,Facebook,"$116,800","$149,300",29,4.3,1.1,32%,96%,78%,44%

In [28]:

salary_survey.columns = salary_survey.iloc[2]
salary_survey_cleaned = salary_survey.drop([0,1,2])
salary_survey_cleaned.reset_index(drop=True)

2,Survey Year,Timestamp,SalaryUSD,Country,PostalCode,PrimaryDatabase,YearsWithThisDatabase,OtherDatabases,EmploymentStatus,JobTitle,...,HoursWorkedPerWeek,TelecommuteDaysPerWeek,PopulationOfLargestCityWithin20Miles,EmploymentSector,LookingForAnotherJob,CareerPlansThisYear,Gender,OtherJobDuties,KindsOfTasksPerformed,Counter
0,2017,1/5/2017 5:10:20,200000,United States,Not Asked,Microsoft SQL Server,10,MySQL/MariaDB,Full time employee,DBA,...,45,1,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1
1,2017,1/5/2017 5:26:23,61515,United Kingdom,Not Asked,Microsoft SQL Server,15,"Oracle, PostgreSQL",Full time employee,DBA,...,35,2,Not Asked,Private business,No,Not Asked,Not Asked,Not Asked,Not Asked,1
2,2017,1/5/2017 5:32:57,95000,Germany,Not Asked,Microsoft SQL Server,5,"Oracle, MySQL/MariaDB, Informix",Full time employee,Other,...,45,"None, or less than 1 day per week",Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1
3,2017,1/5/2017 5:33:03,56000,United Kingdom,Not Asked,Microsoft SQL Server,6,NaN,Full time employee,DBA,...,40,1,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1
4,2017,1/5/2017 5:34:34,35000,France,Not Asked,Microsoft SQL Server,10,Oracle,Full time employee of a consulting/contracting...,DBA,...,40,"None, or less than 1 day per week",Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6888,2019,1/4/2019 6:16:12,32000,Hungary,NaN,Microsoft SQL Server,3,"Azure SQL DB, Amazon RDS (any flavor)",Full time employee,DBA (General - splits time evenly between writ...,...,40,2,20K-99K (large town),Private business,No,"Stay with the same employer, same role",Male,NaN,"On-call as part of a rotation, Projects",1
6889,2019,1/4/2019 6:18:47,32000,Hungary,NaN,Microsoft SQL Server,3,"Azure SQL DB, Amazon RDS (any flavor)",Full time employee,DBA (General - splits time evenly between writ...,...,40,2,20K-99K (large town),Private business,No,"Stay with the same employer, same role",Male,NaN,Projects,1
6890,2019,1/4/2019 9:06:06,40000,Portugal,1000,Microsoft SQL Server,10,NaN,Full time employee of a consulting/contracting...,"Developer: App code (C#, JS, etc)",...,40,"None, or less than 1 day per week",300K-1M (large city),Private business,"Yes, but only passively (just curious)","Stay with the same employer, same role",Male,"DBA (Development Focus - tunes queries, indexe...","Manual tasks, Meetings & management, On-call a...",1
6891,2019,1/4/2019 10:06:25,130000,United States,49506,Microsoft SQL Server,20,NaN,Full time employee of a consulting/contracting...,DBA (General - splits time evenly between writ...,...,42,"None, or less than 1 day per week",100K-299K (city),Private business,"Yes, actively looking for something else",Prefer not to say,Female,NaN,"Build scripts & automation tools, Projects, R&D",1
6892,2019,1/5/2019 18:25:22,84500,Canada,N2K 4L5,Microsoft SQL Server,19,NaN,Full time employee,Architect,...,40,"None, or less than 1 day per week",300K-1M (large city),Private business,"Yes, but only passively (just curious)",Prefer not to say,Male,"DBA (Development Focus - tunes queries, indexe...",NaN,1

In [29]:
us_salary = salary_survey_cleaned[salary_survey_cleaned["Country"]=="United States"]
us_salary

2,Survey Year,Timestamp,SalaryUSD,Country,PostalCode,PrimaryDatabase,YearsWithThisDatabase,OtherDatabases,EmploymentStatus,JobTitle,...,HoursWorkedPerWeek,TelecommuteDaysPerWeek,PopulationOfLargestCityWithin20Miles,EmploymentSector,LookingForAnotherJob,CareerPlansThisYear,Gender,OtherJobDuties,KindsOfTasksPerformed,Counter
3,2017,1/5/2017 5:10:20,200000,United States,Not Asked,Microsoft SQL Server,10,MySQL/MariaDB,Full time employee,DBA,...,45,1,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1
15,2017,1/5/2017 7:22:44,137500,United States,Not Asked,Microsoft SQL Server,16,"Azure SQL DB, Amazon RDS (any flavor)",Full time employee of a consulting/contracting...,DBA,...,55,5 or more,Not Asked,Private business,No,Not Asked,Not Asked,Not Asked,Not Asked,1
17,2017,1/5/2017 7:35:04,85000,United States,Not Asked,Microsoft SQL Server,8,"MySQL/MariaDB, PostgreSQL, Microsoft Access",Full time employee,DBA,...,50,"None, or less than 1 day per week",Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1
18,2017,1/5/2017 7:36:32,96000,United States,Not Asked,Microsoft SQL Server,5,Microsoft Access,Full time employee,DBA,...,45,1,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1
20,2017,1/5/2017 7:36:56,66000,United States,Not Asked,Microsoft SQL Server,10,"Microsoft SQL Server, PostgreSQL, MongoDB, Mic...",Full time employee,"Developer: App code (C#, JS, etc)",...,60,5 or more,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6886,2019,1/3/2019 8:03:37,101500,United States,44122,Microsoft SQL Server,8,"Microsoft SQL Server, Oracle, Azure SQL DB",Full time employee,DBA (Production Focus - build & troubleshoot s...,...,43,1,300K-1M (large city),Private business,No,"Stay with the same employer, same role",Male,NaN,"Build scripts & automation tools, Manual tasks...",1
6887,2019,1/3/2019 9:53:49,107000,United States,29201,Microsoft SQL Server,9,NaN,Full time employee,DBA (Production Focus - build & troubleshoot s...,...,45,1,100K-299K (city),Private business,"Yes, but only passively (just curious)","Stay with the same role, but change employers",Male,Engineer,"Build scripts & automation tools, Manual tasks...",1
6889,2019,1/3/2019 11:32:52,132000,United States,03873,Microsoft SQL Server,20,Azure SQL DB,Full time employee of a consulting/contracting...,"DBA (Development Focus - tunes queries, indexe...",...,45,5 or more,100K-299K (city),Private business,No,"Stay with the same employer, same role",Male,"Architect, DBA (General - splits time evenly b...","Build scripts & automation tools, Manual tasks...",1
6890,2019,1/3/2019 11:38:04,58500,United States,50266,Microsoft SQL Server,5,"Oracle, Microsoft Access",Full time employee,Analyst,...,40,"None, or less than 1 day per week",100K-299K (city),Private business,No,"Stay with the same employer, same role",Male,"DBA (Development Focus - tunes queries, indexe...","On-call as part of a rotation, Projects",1
6894,2019,1/4/2019 10:06:25,130000,United States,49506,Microsoft SQL Server,20,NaN,Full time employee of a consulting/contracting...,DBA (General - splits time evenly between writ...,...,42,"None, or less than 1 day per week",100K-299K (city),Private business,"Yes, actively looking for something else",Prefer not to say,Female,NaN,"Build scripts & automation tools, Projects, R&D",1

In [33]:
positions = list(us_salary["JobTitle"].unique())
positions

['DBA',
 'Developer: App code (C#, JS, etc)',
 'Architect',
 'Developer: T-SQL',
 'Engineer',
 'Developer: Business Intelligence (SSRS, PowerBI, etc)',
 'Other',
 'Analyst',
 'Manager',
 'Data Scientist',
 'Principal database engineer',
 'DevOps, Sr Software Engineer DBA',
 'Technician ',
 'Database Specialist',
 'Consultant',
 'Systems Administrator',
 'Sr Consultant ',
 'Analytics consultant',
 'DBA (General - splits time evenly between writing & tuning queries AND building & troubleshooting servers)',
 'DBA (Development Focus - tunes queries, indexes, does deployments)',
 'DBA (Production Focus - build & troubleshoot servers, HA/DR)']

In [50]:
us_salary_edited = us_salary[~us_salary["JobTitle"] == "Manager"]

TypeError: bad operand type for unary ~: 'str'

In [35]:
us_salary.columns

Index(['Survey Year', 'Timestamp', 'SalaryUSD', 'Country', 'PostalCode',
       'PrimaryDatabase', 'YearsWithThisDatabase', 'OtherDatabases',
       'EmploymentStatus', 'JobTitle', 'ManageStaff', 'YearsWithThisTypeOfJob',
       'HowManyCompanies', 'OtherPeopleOnYourTeam', 'CompanyEmployeesOverall',
       'DatabaseServers', 'Education', 'EducationIsComputerRelated',
       'Certifications', 'HoursWorkedPerWeek', 'TelecommuteDaysPerWeek',
       'PopulationOfLargestCityWithin20Miles', 'EmploymentSector',
       'LookingForAnotherJob', 'CareerPlansThisYear', 'Gender',
       'OtherJobDuties', 'KindsOfTasksPerformed', 'Counter'],
      dtype='object', name=2)

In [37]:
us_salary_cleaned = us_salary[["Survey Year","SalaryUSD","JobTitle","Gender","YearsWithThisTypeOfJob","EmploymentSector"]]
us_salary_cleaned

2,Survey Year,SalaryUSD,JobTitle,Gender,YearsWithThisTypeOfJob,EmploymentSector
3,2017,200000,DBA,Not Asked,5,Private business
15,2017,137500,DBA,Not Asked,6,Private business
17,2017,85000,DBA,Not Asked,2,Private business
18,2017,96000,DBA,Not Asked,5,Private business
20,2017,66000,"Developer: App code (C#, JS, etc)",Not Asked,10,Private business
...,...,...,...,...,...,...
6886,2019,101500,DBA (Production Focus - build & troubleshoot s...,Male,9,Private business
6887,2019,107000,DBA (Production Focus - build & troubleshoot s...,Male,8,Private business
6889,2019,132000,"DBA (Development Focus - tunes queries, indexe...",Male,20,Private business
6890,2019,58500,Analyst,Male,5,Private business
6894,2019,130000,DBA (General - splits time evenly between writ...,Female,17,Private business

In [44]:
salary2017 = us_salary_cleaned[us_salary_cleaned["Survey Year"] == "2017"]
salary2018 = us_salary_cleaned[us_salary_cleaned["Survey Year"] == "2018"]
salary2019 = us_salary_cleaned[us_salary_cleaned["Survey Year"] == "2019"]

In [45]:
salary2017

2,Survey Year,SalaryUSD,JobTitle,Gender,YearsWithThisTypeOfJob,EmploymentSector
3,2017,200000,DBA,Not Asked,5,Private business
15,2017,137500,DBA,Not Asked,6,Private business
17,2017,85000,DBA,Not Asked,2,Private business
18,2017,96000,DBA,Not Asked,5,Private business
20,2017,66000,"Developer: App code (C#, JS, etc)",Not Asked,10,Private business
...,...,...,...,...,...,...
2890,2017,80000,Developer: T-SQL,Not Asked,2,Private business
2892,2017,120000,DBA,Not Asked,5,Private business
2894,2017,108000,DBA,Not Asked,12,Private business
2895,2017,89000,DBA,Not Asked,1,Private business
2899,2017,90000,DBA,Not Asked,3,Private business

In [46]:
salary2018

2,Survey Year,SalaryUSD,JobTitle,Gender,YearsWithThisTypeOfJob,EmploymentSector
2901,2018,115000,DBA (General - splits time evenly between writ...,Male,1,Private business
2904,2018,49000,DBA (General - splits time evenly between writ...,Male,3,Private business
2905,2018,156000,Architect,Male,5,Private business
2906,2018,105000,DBA (General - splits time evenly between writ...,Male,20,Private business
2907,2018,"95,000",DBA (General - splits time evenly between writ...,Male,6,"Education (K-12, college, university)"
...,...,...,...,...,...,...
6007,2018,136000,Manager,Male,1,Private business
6008,2018,"110,000",Manager,Female,1,Private business
6009,2018,85000,"Developer: Business Intelligence (SSRS, PowerB...",Male,2,Local government
6010,2018,160000,"Developer: App code (C#, JS, etc)",Male,8,Private business
6012,2018,119000,Developer: T-SQL,Male,7,Private business

In [47]:
salary2019

2,Survey Year,SalaryUSD,JobTitle,Gender,YearsWithThisTypeOfJob,EmploymentSector
6014,2019,128500,Architect,Male,15,Private business
6016,2019,110000,"DBA (Development Focus - tunes queries, indexe...",Male,18,Private business
6018,2019,65000,Developer: T-SQL,Male,3,Private business
6020,2019,116500,Architect,Male,2,Private business
6022,2019,124000,DBA (General - splits time evenly between writ...,Male,15,Private business
...,...,...,...,...,...,...
6886,2019,101500,DBA (Production Focus - build & troubleshoot s...,Male,9,Private business
6887,2019,107000,DBA (Production Focus - build & troubleshoot s...,Male,8,Private business
6889,2019,132000,"DBA (Development Focus - tunes queries, indexe...",Male,20,Private business
6890,2019,58500,Analyst,Male,5,Private business
6894,2019,130000,DBA (General - splits time evenly between writ...,Female,17,Private business